zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash.c
    /* The default delay time value */
    #define CY_FLASH_DEFAULT_DELAY                     (150UL)
    /* Calculates the time in microseconds to wait for the number of the CM0P ticks */
    #define CY_FLASH_DELAY_CORRECTIVE(ticks)           (((ticks) * 1000UL) / (Cy_SysClk_ClkSlowGetFrequency() / 1000UL))

    /* Number of the CM0P ticks for StartProgram function delay corrective time */
    #define CY_FLASH_START_PROGRAM_DELAY_TICKS         (6000UL)
    /* Delay time for StartProgram function in us */
    #define CY_FLASH_START_PROGRAM_DELAY_TIME          (900UL + CY_FLASH_DELAY_CORRECTIVE(CY_FLASH_START_PROGRAM_DELAY_TICKS))
    /* Number of the CM0P ticks for StartErase functions delay corrective time */
    #define CY_FLASH_START_ERASE_DELAY_TICKS           (9500UL)
    /* Delay time for StartErase functions in us */
    #define CY_FLASH_START_ERASE_DELAY_TIME            (2200UL + CY_FLASH_DELAY_CORRECTIVE(CY_FLASH_START_ERASE_DELAY_TICKS))
    /* Number of the CM0P ticks for StartWrite function delay corrective time */
    #define CY_FLASH_START_WRITE_DELAY_TICKS           (19000UL)
    /* Delay time for StartWrite function in us */
    #define CY_FLASH_START_WRITE_DELAY_TIME            (9800UL + CY_FLASH_DELAY_CORRECTIVE(CY_FLASH_START_WRITE_DELAY_TICKS))

    /** Delay time for Start Write function in us with corrective time */
    #define CY_FLASH_START_WRITE_DELAY                 (CY_FLASH_START_WRITE_DELAY_TIME)
    /** Delay time for Start Program function in us with corrective time */
    #define CY_FLASH_START_PROGRAM_DELAY               (CY_FLASH_START_PROGRAM_DELAY_TIME)
    /** Delay time for Start Erase function in uS with corrective time */
    #define CY_FLASH_START_ERASE_DELAY                 (CY_FLASH_START_ERASE_DELAY_TIME)

    #define CY_FLASH_ENTER_WAIT_LOOP                   (0xFFU)
    #define CY_FLASH_IPC_CLIENT_ID                     (2U)

    /** Semaphore number reserved for flash driver */
    #define CY_FLASH_WAIT_SEMA                         (0UL)
    /* Semaphore check timeout (in tries) */
    #define CY_FLASH_SEMA_WAIT_MAX_TRIES               (150000UL)
#if !defined (CY_IP_MXS40FLASHC)
    static void Cy_Flash_RAMDelay(uint32_t microseconds);

    #if (CY_CPU_CORTEX_M0P)
        #define IS_CY_PIPE_FREE(...)       (!Cy_IPC_Drv_IsLockAcquired(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_CYPIPE_EP1)))
        #define NOTIFY_PEER_CORE(a)         Cy_IPC_Pipe_SendMessage(CY_IPC_EP_CYPIPE_CM4_ADDR, CY_IPC_EP_CYPIPE_CM0_ADDR, (a), NULL)
    #else
        #define IS_CY_PIPE_FREE(...)       (!Cy_IPC_Drv_IsLockAcquired(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_CYPIPE_EP0)))
        #define NOTIFY_PEER_CORE(a)         Cy_IPC_Pipe_SendMessage(CY_IPC_EP_CYPIPE_CM0_ADDR, CY_IPC_EP_CYPIPE_CM4_ADDR, (a), NULL)
    #endif

    static void Cy_Flash_NotifyHandler(uint32_t * msgPtr);

    static cy_stc_flash_notify_t * ipcWaitMessage;
#endif /* !defined (CY_IP_MXS40FLASHC) */
#else
    /** Delay time for Start Write function in us with corrective time */
    #define CY_FLASH_START_WRITE_DELAY                 (CY_FLASH_NO_DELAY)
    /** Delay time for Start Program function in us with corrective time */
    #define CY_FLASH_START_PROGRAM_DELAY               (CY_FLASH_NO_DELAY)
    /** Delay time for Start Erase function in uS with corrective time */
    #define CY_FLASH_START_ERASE_DELAY                 (CY_FLASH_NO_DELAY)

#endif /* !defined (CY_FLASH_RWW_DRV_SUPPORT_DISABLED) */
/** \endcond */

/* Static functions */
static cy_en_flashdrv_status_t Cy_Flash_OperationStatus(void);
#if !defined (CY_IP_MXS40FLASHC)
static bool Cy_Flash_BoundsCheck(uint32_t flashAddr);
static cy_en_flashdrv_status_t Cy_Flash_ProcessOpcode(uint32_t opcode);
static uint32_t Cy_Flash_GetRowNum(uint32_t flashAddr);
static cy_en_flashdrv_status_t Cy_Flash_SendCmd(uint32_t mode, uint32_t microseconds);
static volatile cy_stc_flash_context_t flashContext;
#endif

#if defined (CY_IP_MXS40FLASHC)

#define CYBOOT_FLAGS_BLOCKING 0U
#define CYBOOT_FLAGS_NON_BLOCKING 1U
#define HASH_CALC_DIVISOR 127U
#define HASH_CALC_DIVISOR_LEN 7U
#define REG8(addr)                      ( *( (volatile uint8_t  *)(addr) ) )
#define SECTOR_INDEX_WITHOUT_SFLASH  0U

static cyboot_flash_context_t boot_rom_context;
/* This is a work around in PDL. To cyboot_flash_refresh_init passing an array of cyboot_flash_refresh_t instead of passing a pointer to cyboot_flash_refresh_t.
The change is required to prevent writes to sector 1 from corrupting memory adjacent to the refresh_t structure.
The refresh structure is updated by the flash write routine even if it is not initialized.
This should be fixed in the Boot code later. */
static cyboot_flash_refresh_t flash_refresh[CPUSS_FLASHC_SECTOR_M];
static bool refresh_feature_enable;

/* To calculate hash */
static uint8_t Cy_Flash_GetHash(uint32_t startAddr,uint32_t numberOfBytes);
static void Cy_Flash_Callback_PreIRQ(cyboot_flash_context_t *ctx);
static void Cy_Flash_Callback_PostIRQ(cyboot_flash_context_t *ctx);
static void Cy_Flash_Callback_IRQComplete(cyboot_flash_context_t *ctx);
static cy_flash_callback_t irqComplete_callback = NULL;
static cy_flash_callback_t preIrq_callback = NULL;
static cy_flash_callback_t postIrq_callback = NULL;
#endif /* defined (CY_IP_MXS40FLASHC) */

#if !defined (CY_IP_MXS40FLASHC)
#if !defined (CY_FLASH_RWW_DRV_SUPPORT_DISABLED)
/*******************************************************************************
* Function Name: Cy_Flash_InitExt
****************************************************************************//**
*
* Initiates all needed prerequisites to support flash erase/write.
* Should be called from each core. Defines the address of the message structure.
*
* Requires a call to Cy_IPC_Sema_Init(), Cy_IPC_Pipe_Config() and
* Cy_IPC_Pipe_Init() functions before use.
*
* This function is called in the Cy_Flash_Init() function - see the
* Cy_Flash_Init usage considerations.
*
*******************************************************************************/
void Cy_Flash_InitExt(cy_stc_flash_notify_t *ipcWaitMessageAddr)
{
    ipcWaitMessage = ipcWaitMessageAddr;

    if(ipcWaitMessage != NULL)
    {
        ipcWaitMessage->clientID = CY_FLASH_IPC_CLIENT_ID;
        ipcWaitMessage->pktType = CY_FLASH_ENTER_WAIT_LOOP;
        ipcWaitMessage->intrRelMask = 0U;
    }

