zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash.c
        /*******************************************************************************
        * Function Name: Cy_Flash_ResumeIrqHandler
        ****************************************************************************//**
        *
        * This is the interrupt service routine to make additional processing of the
        * flash operations resume phase.
        *
        *******************************************************************************/
        CY_SECTION_RAMFUNC_BEGIN
        #if !defined (__ICCARM__)
            CY_NOINLINE
        #endif
        void Cy_Flash_ResumeIrqHandler(void)
        {
            IPC_STRUCT_Type * locIpcBase = Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_CYPIPE_EP0);

            uint32_t bookmark;
            #if ((CY_CPU_CORTEX_M4) && (defined (CY_DEVICE_SECURE)))
                bookmark = CY_PRA_REG32_GET(CY_PRA_INDX_FLASHC_FM_CTL_BOOKMARK) & 0xffffUL;
            #else
                bookmark = FLASHC_FM_CTL_BOOKMARK & 0xffffUL;
            #endif /* ((CY_CPU_CORTEX_M4) && (defined (CY_DEVICE_SECURE))) */

            uint32_t intr = Cy_SysLib_EnterCriticalSection();

            uint32_t cm0s = CPUSS_CM0_STATUS;
            bool sflashSingleCore = (0U == SFLASH_SINGLE_CORE);

            if ((bookmark == CY_FLASH_PROGRAM_ROW_BOOKMARK) || (bookmark == CY_FLASH_ERASE_ROW_BOOKMARK) ||
                (bookmark == CY_FLASH_WRITE_ROW_ERASE_BOOKMARK) || (bookmark == CY_FLASH_WRITE_ROW_PROGRAM_BOOKMARK))
            {
                if ((cm0s == (CPUSS_CM0_STATUS_SLEEPING_Msk | CPUSS_CM0_STATUS_SLEEPDEEP_Msk)) && sflashSingleCore)
                {
                    REG_IPC_STRUCT_NOTIFY(locIpcBase) = _VAL2FLD(IPC_STRUCT_NOTIFY_INTR_NOTIFY, (1UL << CY_IPC_INTR_CYPIPE_EP0));
                    while (CPUSS_CM0_STATUS == (CPUSS_CM0_STATUS_SLEEPING_Msk | CPUSS_CM0_STATUS_SLEEPDEEP_Msk))
                    {
                        /* Wait until the core is active */
                    }
                }
                Cy_Flash_RAMDelay(CY_FLASH_FINAL_STAGE_DELAY);
            }

            Cy_SysLib_ExitCriticalSection(intr);
        }
        CY_SECTION_RAMFUNC_END
    #endif /* (CY_CPU_CORTEX_M4) */
#endif /* !defined (CY_FLASH_RWW_DRV_SUPPORT_DISABLED) */

#else

/*******************************************************************************
* Function Name: Cy_Flash_Process_BootRom_Error_Code
****************************************************************************//**
*
* Converts Boot Rom Call returns to the Flash driver return defines.
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_Process_BootRom_Error_Code(uint32_t error_code)
{
    cy_en_flashdrv_status_t result;

    switch (error_code)
    {
        case CYBOOT_FLASH_SUCCESS:
        {
            result = CY_FLASH_DRV_SUCCESS;
            break;
        }
        case CYBOOT_FLASH_INIT_FAILED:
        {
            result = CY_FLASH_DRV_INIT_FAILED;
            break;
        }
        case CYBOOT_FLASH_ADDR_INVALID:
        {
            result = CY_FLASH_DRV_INVALID_FLASH_ADDR;
            break;
        }
        case CYBOOT_FLASH_PARAM_INVALID:
        {
            result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
            break;
        }
        case CYBOOT_FLASH_RECOVER_ERR:
        {
        #if defined(CY_DEVICE_PSC3)
            result = CY_FLASH_DRV_REFRESH_NOTHING;
        #else
            result = CY_FLASH_DRV_ERR_UNC;
        #endif /* defined(CY_DEVICE_PSC3) */
            break;
        }
        case CYBOOT_FAULT_UNEXPECTED:
        {
            result = CY_FLASH_DRV_ERR_UNC;
            break;
        }
        default:
        {
            result = CY_FLASH_DRV_ERR_UNC;
            break;
        }
    }

    return (result);
}


/* These API's are call back functions from boot rom code.
   These needs to be passed to the boot rom in the init function.
   Current architecture in the PDL is not using the callback calls from boot rom.
   PDL gets the status of the operation complete by calling cyboot_is_flash_ready().
   cyboot_is_flash_ready is called from the existing function Cy_Flash_IsOperationComplete().
*/
/*******************************************************************************
* Function Name: Cy_Flash_Callback_PreIRQ
****************************************************************************//**
*
* Call back function from boot rom before the non blocking operation is started.
*
*******************************************************************************/
static void Cy_Flash_Callback_PreIRQ(cyboot_flash_context_t *ctx)
{
    if(NULL != preIrq_callback)
    {
        preIrq_callback();
    }
    (void) ctx;
}
/*******************************************************************************
* Function Name: Cy_Flash_Callback_PostIRQ
****************************************************************************//**
*
* Call back function from boot rom after the non blocking operation is started.
*
*******************************************************************************/
static void Cy_Flash_Callback_PostIRQ(cyboot_flash_context_t *ctx)
{
    if(NULL != postIrq_callback)
    {
        postIrq_callback();
    }
    (void) ctx;
}
/*******************************************************************************
* Function Name: Cy_Flash_Callback_IRQComplete
****************************************************************************//**
*
* Call back function from boot rom after the completion of non blocking operation.
*
*******************************************************************************/
static void Cy_Flash_Callback_IRQComplete(cyboot_flash_context_t *ctx)
{
    if(NULL != irqComplete_callback)
    {
        irqComplete_callback();
    }
    (void) ctx;
}

/*******************************************************************************
* Function Name: Cy_Flash_Init
****************************************************************************//**
*
* Initiates all needed prerequisites to support flash erase/write.
* Should be once before starting any flash operations.
*
* param refresh_enable enable disable refresh feature
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Init(bool refresh_enable)
{
    cy_en_sysint_status_t sysStatus;
    const cy_stc_sysint_t flash_isr_cfg =
    {
        .intrSrc = (IRQn_Type) cpuss_interrupt_fm_cbus_IRQn,
        .intrPriority = 7,
    };

    sysStatus = Cy_SysInt_Init(&flash_isr_cfg, ROM_FUNC->cyboot_flash_irq_handler);
    if(CY_SYSINT_SUCCESS != sysStatus)
    {
        return CY_FLASH_DRV_ERR_UNC;
    }
    NVIC_EnableIRQ(flash_isr_cfg.intrSrc);

    __enable_irq();
    boot_rom_context.callback_pre_irq  = (cyboot_flash_callback_t)Cy_Flash_Callback_PreIRQ;
    boot_rom_context.callback_post_irq = (cyboot_flash_callback_t)Cy_Flash_Callback_PostIRQ;
    boot_rom_context.callback_complete = (cyboot_flash_callback_t)Cy_Flash_Callback_IRQComplete;

    if(refresh_enable)
    {
        refresh_feature_enable = refresh_enable;
        boot_rom_context.refresh = flash_refresh;
        /* Need to initialize boot_rom_context.refresh before working with flash */
        ROM_FUNC->cyboot_flash_refresh_init((uint32_t)SECTOR_INDEX_WITHOUT_SFLASH, flash_refresh);
        /* To recover a previous failure, if any */
        uint32_t ret = ROM_FUNC->cyboot_flash_refresh_recover((uint32_t)SECTOR_INDEX_WITHOUT_SFLASH, flash_refresh);
        return Cy_Flash_Process_BootRom_Error_Code(ret);
    }
    return CY_FLASH_DRV_SUCCESS;
}

