zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash.c
/*******************************************************************************
* Function Name: Cy_Flash_RegisterCallback
****************************************************************************//**
*
* Registers callback functions
*
* \param callBacks pointer to the callback functions structure \ref cy_stc_flash_callback_t
*
* \note Total 3 callbacks 1) Before starting the operation 2) When the operation is started 3) After completion of the operation.
*
*******************************************************************************/

void Cy_Flash_RegisterCallback(cy_stc_flash_callback_t *callBacks)
{
    if(NULL != callBacks)
    {
        if(NULL != callBacks->callback_before_operation)
        {
            preIrq_callback = callBacks->callback_before_operation;
        }
        if(NULL != callBacks->callback_operation_started)
        {
            postIrq_callback = callBacks->callback_operation_started;
        }
        if(NULL != callBacks->callback_operation_complete)
        {
            irqComplete_callback = callBacks->callback_operation_complete;
        }
    }
}
/*******************************************************************************
* Function Name: Cy_Flash_Is_Refresh_Required
********************************************************************************
* Checks whether a flash refresh is needed for a sector.
* \param refresh    A pointer to a single refresh structure.
* \returns
* - TRUE, if a refresh is needed.
* - FALSE, if a refresh is not needed.
*******************************************************************************/
bool Cy_Flash_Is_Refresh_Required(void)
{
    return ROM_FUNC->cyboot_flash_refresh_test(flash_refresh);
}
#endif /* !defined (CY_IP_MXS40FLASHC) */

/*******************************************************************************
* Function Name: Cy_Flash_EraseRow
****************************************************************************//**
*
* This function erases a single row of flash. Reports success or
* a reason for failure. Does not return until the Write operation is
* complete. Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in
* the case when another process is writing to flash or erasing the row.
* User firmware should not enter the Hibernate or Deep Sleep mode until flash Erase
* is complete. The Flash operation is allowed in Sleep mode.
* During the Flash operation, the device should not be reset, including the
* XRES pin, a software reset, and watchdog reset sources. Also, low-voltage
* detect circuits should be configured to generate an interrupt instead of a
* reset. Otherwise, portions of flash may undergo unexpected changes.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseRow(uint32_t rowAddr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;

#if !defined (CY_IP_MXS40FLASHC)
    /* Prepares arguments to be passed to SROM API */
    if (Cy_Flash_BoundsCheck(rowAddr) != false)
    {
        SystemCoreClockUpdate();
        flashContext.opcode = CY_FLASH_OPCODE_ERASE_ROW | CY_FLASH_BLOCKING_MODE;
        flashContext.arg1 = rowAddr;
        flashContext.arg2 = 0UL;
        flashContext.arg3 = 0UL;

        if (cy_device->flashEraseDelay != 0U)
        {
            result = Cy_Flash_SendCmd(CY_FLASH_BLOCKING_MODE, CY_FLASH_START_ERASE_DELAY);
        }
        else
        {
            result = Cy_Flash_SendCmd(CY_FLASH_BLOCKING_MODE, CY_FLASH_NO_DELAY);
        }
    }
#else
        boot_rom_context.flags = CYBOOT_FLAGS_BLOCKING;
        uint32_t status = ROM_FUNC->cyboot_flash_erase_row(FLASH_SBUS_ALIAS_ADDRESS(rowAddr), &boot_rom_context);
        result = Cy_Flash_Process_BootRom_Error_Code(status);
#endif /* !defined (CY_IP_MXS40FLASHC) */


    return (result);
}


/*******************************************************************************
* Function Name: Cy_Flash_StartEraseRow
****************************************************************************//**
*
* Starts erasing a single row of flash. Returns immediately
* and reports a successful start or reason for failure.
* Reports a CY_FLASH_DRV_IPC_BUSY error in the case when IPC structure is locked
* by another process. User firmware should not enter the Hibernate or Deep Sleep mode until
* flash Erase is complete. The Flash operation is allowed in Sleep mode.
* During the flash operation, the device should not be reset, including the
* XRES pin, a software reset, and watchdog reset sources. Also, the low-voltage
* detect circuits should be configured to generate an interrupt instead of a reset.
* Otherwise, portions of flash may undergo unexpected changes.
* To avoid situation of reading data from cache memory - before
* reading data from previously programmed/erased flash rows, the user must
* clear the flash cache with the Cy_SysLib_ClearFlashCacheAndBuffer()
* function.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_StartEraseRow(uint32_t rowAddr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
#if !defined (CY_IP_MXS40FLASHC)
    if (Cy_Flash_BoundsCheck(rowAddr) != false)
    {
        SystemCoreClockUpdate();

        /* Prepares arguments to be passed to SROM API */
        flashContext.opcode = CY_FLASH_OPCODE_ERASE_ROW;
        if (SFLASH_SINGLE_CORE != 0U)
        {
            flashContext.opcode |= CY_FLASH_BLOCKING_MODE;
        }

        flashContext.arg1 = rowAddr;
        flashContext.arg2 = 0UL;
        flashContext.arg3 = 0UL;

        if (cy_device->flashEraseDelay != 0U)
        {
            result = Cy_Flash_SendCmd(CY_FLASH_NON_BLOCKING_MODE, CY_FLASH_START_ERASE_DELAY);
        }
        else
        {
            result = Cy_Flash_SendCmd(CY_FLASH_NON_BLOCKING_MODE, CY_FLASH_NO_DELAY);
        }
    }
#else
        boot_rom_context.flags = CYBOOT_FLAGS_NON_BLOCKING;
        uint32_t status = ROM_FUNC->cyboot_flash_erase_row_start(FLASH_SBUS_ALIAS_ADDRESS(rowAddr), &boot_rom_context);
        if(status == (uint32_t)CYBOOT_FLASH_SUCCESS)
        {
            result = CY_FLASH_DRV_OPERATION_STARTED;
        }
        else
        {
            result = Cy_Flash_Process_BootRom_Error_Code(status);
        }
#endif /* !defined (CY_IP_MXS40FLASHC) */

    return (result);
}

#if !defined (CY_IP_MXS40FLASHC)
/*******************************************************************************
* Function Name: Cy_Flash_EraseSector
****************************************************************************//**
*
* This function erases a sector of flash. Reports success or
* a reason for failure. Does not return until the Erase operation is
* complete. Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in
* the case when another process is writing to flash or erasing the row.
* User firmware should not enter the Hibernate or Deep Sleep mode until flash Erase
* is complete. The Flash operation is allowed in Sleep mode.
* During the Flash operation, the device should not be reset, including the
* XRES pin, a software reset, and watchdog reset sources. Also, low-voltage
* detect circuits should be configured to generate an interrupt instead of a
* reset. Otherwise, portions of flash may undergo unexpected changes.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseSector(uint32_t sectorAddr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;

    /* Prepares arguments to be passed to SROM API */
    if (Cy_Flash_BoundsCheck(sectorAddr) != false)
    {
        SystemCoreClockUpdate();

        flashContext.opcode = CY_FLASH_OPCODE_ERASE_SECTOR | CY_FLASH_BLOCKING_MODE;
        flashContext.arg1 = sectorAddr;
        flashContext.arg2 = 0UL;
        flashContext.arg3 = 0UL;

