zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash.c
/*******************************************************************************
* Function Name: Cy_Flash_OperationStatus
****************************************************************************//**
*
* Checks the status of the Flash Operation, and returns it.
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_OperationStatus(void)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_OPCODE_BUSY;
#if !defined (CY_IP_MXS40FLASHC)
    /* Checks if the IPC structure is not locked */
    if (Cy_IPC_Drv_IsLockAcquired(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_SYSCALL)) == false)
    {
        /* The result of SROM API calling is returned to the driver context */
        result = Cy_Flash_ProcessOpcode(flashContext.opcode);

        /* Clear pre-fetch cache after flash operation */
        #if CY_CPU_CORTEX_M4 && defined (CY_DEVICE_SECURE)
            CY_PRA_REG32_SET(CY_PRA_INDX_FLASHC_FLASH_CMD, FLASHC_FLASH_CMD_INV_Msk);
            while (CY_PRA_REG32_GET(CY_PRA_INDX_FLASHC_FLASH_CMD) != 0U)
            {
            }
        #else
            FLASHC_FLASH_CMD = FLASHC_FLASH_CMD_INV_Msk;
            while (FLASHC_FLASH_CMD != 0U)
            {
            }
        #endif /* CY_CPU_CORTEX_M4 && defined (CY_DEVICE_SECURE) */
    }
#else
    if(ROM_FUNC->cyboot_is_flash_ready(&boot_rom_context))
    {
        return CY_FLASH_DRV_SUCCESS;
    }
#endif /* !defined (CY_IP_MXS40FLASHC) */
    return (result);
}


/*******************************************************************************
* Function Name: Cy_Flash_GetExternalStatus
****************************************************************************//**
*
* This function handles the case where a module such as security image captures
* a system call from this driver and reports its own status or error code,
* for example protection violation. In that case, a function from this
* driver returns an unknown error (see cy_en_flashdrv_status_t). After receipt
* of an unknown error, the user may call this function to get the status
* of the capturing module.
*
* The user is responsible for parsing the content of the returned value
* and casting it to the appropriate enumeration.
*******************************************************************************/
uint32_t Cy_Flash_GetExternalStatus(void)
{
#if !defined (CY_IP_MXS40FLASHC)
    return (flashContext.opcode);
#else
    if(Cy_Flash_IsOperationComplete() == CY_FLASH_DRV_SUCCESS)
    {
        return (uint32_t)CY_FLASH_DRV_SUCCESS;
    }
    else
    {
        return (uint32_t)CY_FLASH_DRV_OPCODE_BUSY;
    }
#endif /* !defined (CY_IP_MXS40FLASHC) */
}


#if defined (CY_IP_MXS40FLASHC)

/** \cond INTERNAL */

/*******************************************************************************
* Function Name: memcpy8
********************************************************************************
* Performs a fast memcpy4 by unrolling a loop.
* \param dst    A pointer to a destination buffer, should be aligned to 4 bytes.
* \param src    A pointer to a source buffer, should be aligned to 4 bytes.
* \param size   A size in byte to be copied, must be a multiple of 8 bytes
*******************************************************************************/
static void memcpy8(uint32_t *dst, const uint32_t *src, uint32_t size)
{
    do
    {
        dst[0] = src[0];
        dst[1] = src[1];
        dst = &dst[2];
        src = &src[2];
        size -= 8UL;
    } while (size != 0UL);
}

/*******************************************************************************
* Function Name: cy_flash_scratch_row_addr
********************************************************************************
* Computes an address for a flash scratch row \c scratch_row_idx in a sector
* \c sector_idx.
* \param sector_idx         A flash sector.
* \param scratch_row_idx    A flash scratch row index within a flash sector.
*
* \returns An address for a flash scratch row.
*******************************************************************************/
static uint32_t cy_flash_scratch_row_addr(uint32_t sector_idx, uint32_t scratch_row_idx)
{
    return CYBOOT_SCRATCH_BASE_ADDR
            + (sector_idx * (CYBOOT_N_SCRATCH_ROWS * CY_FLASH_ROW_SIZE))
            + (scratch_row_idx * CY_FLASH_ROW_SIZE);
}

/*******************************************************************************
* Function Name: cy_flash_refresh_perform
********************************************************************************
* Performs a blocking flash refresh operation for one flash sector.
* \param sector_idx     A sector index.
* \param refresh        A pointer to a single refresh structure.
*
* \returns  A status code.
*******************************************************************************/
static cy_en_flashdrv_status_t cy_flash_refresh_perform(uint32_t sector_idx, cyboot_flash_refresh_t *refresh)
{
    cyboot_flash_context_t ctx = { 0UL, };

    /* An index for flash row's column 33 in uint32_t[] */
    uint32_t COL33_IDX = (CY_FLASH_ROW_SIZE / sizeof(uint32_t));
    cyboot_flash_row_t row_data;
    uint32_t ret = CYBOOT_FLASH_FAILED;
    uint32_t scratch_addr;
    uint32_t min_addr;
    ctx.flags = CY_FLASH_MODE_REFRESH_MANUAL;

    if (!ROM_FUNC->cyboot_flash_refresh_test(refresh))
    {
        return CY_FLASH_DRV_REFRESH_NOTHING;
    }

    scratch_addr = cy_flash_scratch_row_addr(sector_idx, refresh->scratch_row_idx);
    refresh->scratch_row_idx = (refresh->scratch_row_idx + 1UL) % CYBOOT_N_SCRATCH_ROWS;
    min_addr = refresh->min_page_addr;

    memcpy8((uint32_t *)row_data, (uint32_t *)min_addr, CY_FLASH_ROW_SIZE);
    ++refresh->max_count;
    row_data[COL33_IDX      ] = CYBOOT_FLASH_REFRESH_TAG;
    row_data[COL33_IDX + 1UL] = refresh->max_count;
    row_data[COL33_IDX + 2UL] = min_addr;
    row_data[COL33_IDX + 3UL] = 0UL;
    (void)ROM_FUNC->cyboot_flash_write_row(scratch_addr, row_data, &ctx);

    CY_SET_REG32(0x52152A10, 0x01000000); /* if_sel=1 (FLASH_MACRO_CTL) */
    CY_SET_REG32(0x52152A58, 0x00000001); /* ACLK  (ACLK_CTL) */
    CY_SET_REG32(0x52152A10, 0x00000000); /* if_sel=0  (FLASH_MACRO_CTL) */

    ++refresh->max_count;
    row_data[COL33_IDX + 1UL] = refresh->max_count;
    row_data[COL33_IDX + 2UL] = 0UL;
    ret = ROM_FUNC->cyboot_flash_write_row(min_addr, row_data, &ctx);
    if (CYBOOT_FLASH_SUCCESS == ret)
    {
        ROM_FUNC->cyboot_flash_refresh_get_min_max(sector_idx, refresh);
    }

