zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash.c
    return Cy_Flash_Process_BootRom_Error_Code(ret);
}
/** \endcond */

/*******************************************************************************
* Function Name: Cy_Flash_Refresh
****************************************************************************//**
*
* This is a blocking call.
* Writes to the flash will cause slight degradation of the other cells in the flash.
* If the flash is written more than 100,000 times, errors may appear on flash reads.
* To prevent this, the refresh functions should be called before or after flash writes.
* The refresh functions are not available on CPUSS_FLASHC_SFLASH_SECNUM because it includes the SFLASH.
*
* param address of the row that needs to be refreshed.
*
* return success if refresh is complete. will return err
*
* \note Refresh is not allowed on sector which has SFLASH. That sector must be left immutable.
*       This is a blocking call.
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Refresh(uint32_t flashAddr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_REFRESH_NOT_ENABLED;
    if (IS_FLASH_ADDRESS_IN_SFLASH_SECNUM(FLASH_SBUS_ALIAS_ADDRESS(flashAddr)))
    {
        return CY_FLASH_DRV_REFRESH_NOT_SUPPORTED;
    }
    if (refresh_feature_enable)
    {
        uint32_t sector_Idx;
        uint32_t row_Idx;
        uint32_t status = ROM_FUNC->cyboot_flash_refresh_get_sector_idx(FLASH_SBUS_ALIAS_ADDRESS(flashAddr), &sector_Idx, &row_Idx);
        (void)row_Idx;

        if (status == CYBOOT_FLASH_SUCCESS)
        {
        #if defined(CY_DEVICE_PSC3)
            result = (cy_en_flashdrv_status_t)cy_flash_refresh_perform(sector_Idx, flash_refresh);
        #else
            status = ROM_FUNC->cyboot_flash_refresh_perform(sector_Idx, flash_refresh);
            result = Cy_Flash_Process_BootRom_Error_Code(status);
        #endif
        }
        else
        {
            result = Cy_Flash_Process_BootRom_Error_Code(status);
        }
    }
    return result;
}

/*******************************************************************************
* Function Name: Cy_Flash_Refresh_Start
****************************************************************************//**
*
* This is a non-blocking call.
* Writes to the flash will cause slight degradation of the other cells in the flash.
* If the flash is written more than 100,000 times, errors may appear on flash reads.
* To prevent this, the refresh functions should be called before or after flash writes.
* The refresh functions are not available on CPUSS_FLASHC_SFLASH_SECNUM because it includes the SFLASH.
*
* \param address of the row that needs to be refreshed.
*
* \return success if refresh is started. Else will return err
*
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Refresh_Start(uint32_t flashAddr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_REFRESH_NOT_ENABLED;
    if (IS_FLASH_ADDRESS_IN_SFLASH_SECNUM(FLASH_SBUS_ALIAS_ADDRESS(flashAddr)))
    {
        return CY_FLASH_DRV_REFRESH_NOT_SUPPORTED;
    }
    if (refresh_feature_enable)
    {
        uint32_t sector_Idx;
        uint32_t row_Idx;
        uint32_t status = ROM_FUNC->cyboot_flash_refresh_get_sector_idx(FLASH_SBUS_ALIAS_ADDRESS(flashAddr), &sector_Idx, &row_Idx);
        if (status == CYBOOT_FLASH_SUCCESS)
        {
            status = ROM_FUNC->cyboot_flash_refresh_perform_start(sector_Idx, flash_refresh, &boot_rom_context);
            if (status == (uint32_t)CYBOOT_FLASH_SUCCESS)
            {
                return CY_FLASH_DRV_OPERATION_STARTED;
            }
        }
        (void)row_Idx;
        result = Cy_Flash_Process_BootRom_Error_Code(status);
    }
    return result;
}
/*****************************************************************************
* Function Name: GetHash()
******************************************************************************
* Summary:
*  This function computes the hash based on formula
*  H(n+1)=(H(n)*2+Byte)%127,where H(0)=0
*
* Parameters:
*  uint32_t startAddr - 32 bit system address of  first byte of data chunk
*  uint32_t numberOfBytes    - total number of bytes of data chunk on which hash needs
*  to be computed

* Return:
*  uint8_t hash
*
* Calls:
*  None
*
* Called by:
*  Boot
*
* Note:
*  cHash represents the calculated hash (H in the above formula).
*  HASH_CALC_DIVISOR = 127 and HASH_CALC_DIVISOR_LEN = 7
*  Mod 127 is calculated using the following method.
*  Any number N (< 128*127 + 127 = 16383) can be represented in the form of
*  N = 128*A + B = 127*A + A + B. Thus, N mod 127 can be calculated from A + B.
*  If A + B == 254, then N mod 127 = 0
*  Else if A + B >= 127, then N mod 127 = A + B - 127
*  Else N mod 127 = A + B
*  For the given implementation, N < 255*2 + 255 = 766. Hence, A + B < 254
*  This method reduces the computational cost by avoiding divide operation.
*****************************************************************************/
static uint8_t Cy_Flash_GetHash(uint32_t startAddr,uint32_t numberOfBytes)
{
    uint32_t i;
    uint8_t hash = 0U;
    uint32_t cHashSum;

     uint8_t cData, cHigherPart, cLowerPart;
    for (i = 0U; i < numberOfBytes; i++)
    {
        cData = REG8(startAddr + i);
        cHashSum = (((uint32_t) hash << 1U) + cData);
         /* PRQA S 2985 4 */ /* FIXMISRA */ /* MISRA C:2012 Rule 2.2 Required
            This operation is redundant. The value of the result is always that of the left-hand operand.
            The cHashSum equals cData, that is 8-bit value, shifted left by 7 bit (HASH_CALC_DIVISOR_LEN).
        */
        cHigherPart = (uint8_t)(cHashSum >> HASH_CALC_DIVISOR_LEN) & HASH_CALC_DIVISOR;
        cLowerPart = (uint8_t) (cHashSum & HASH_CALC_DIVISOR);
        hash = ( (cHigherPart + cLowerPart) >=  HASH_CALC_DIVISOR ) ? (cHigherPart + cLowerPart - HASH_CALC_DIVISOR) :
                 (cHigherPart + cLowerPart);
    }
    return hash;
}

/*******************************************************************************
* Function Name: Cy_Flashc_ECCEnable
****************************************************************************//**
*
* \brief Enables ECC for flash
* ECC checking/reporting on FLASH interface is enabled.
* Correctable or non-correctable faults are reported by enabling ECC.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_ECCEnable(void)
{
    FLASHC_FLASH_CTL |= FLASHC_FLASH_CTL_ECC_EN_Msk;
}

