zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash.c
/*******************************************************************************
* Function Name: Cy_Flashc_ECCDisable
****************************************************************************//**
*
* \brief Disables ECC for flash
* ECC checking/reporting on FLASH interface is disabled.
* Correctable or non-correctable faults are not reported by disabling ECC.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_ECCDisable(void)
{
    FLASHC_FLASH_CTL &= (uint32_t) ~FLASHC_FLASH_CTL_ECC_EN_Msk;
}

/*******************************************************************************
* Function Name: Cy_Flashc_INJ_ECCEnable
****************************************************************************//**
*
* This function enable ECC error injection for FLASH interface
* And is applicable while ECC is enabled.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_INJ_ECCEnable(void)
{
    FLASHC_FLASH_ECC_INJ_EN |= (FLASHC_ECC_INJ_EN_ECC_INJ_ENABLE_Msk |
                               FLASHC_ECC_INJ_EN_ECC_ERROR_Msk);
}

/*******************************************************************************
* Function Name: Cy_Flashc_INJ_ECCDisable
****************************************************************************//**
*
* This function disables ECC error injection for FLASH interface
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_INJ_ECCDisable(void)
{
    FLASHC_FLASH_ECC_INJ_EN &= (uint32_t) ~(FLASHC_ECC_INJ_EN_ECC_INJ_ENABLE_Msk |
                               FLASHC_ECC_INJ_EN_ECC_ERROR_Msk);
}


/*******************************************************************************
* Function Name: Cy_Flashc_InjectECC
****************************************************************************//**
*
* This function enables ECC injection and sets the address where a parity will be injected
* and the parity value.
* Reports success or a reason for failure.
*
* \address The address where ECC parity will be injected.
*
* \parity The parity value which will be injected.
*
* \returns none
*
*******************************************************************************/
void Cy_Flashc_InjectECC(uint32_t address, uint8_t parity)
{
    FLASHC_FLASH_ECC_INJ_CTL = (_VAL2FLD(FLASHC_ECC_INJ_CTL_WORD_ADDR, address) |
                                _VAL2FLD(FLASHC_ECC_INJ_CTL_PARITY, parity ));
}

/*******************************************************************************
* Function Name: Cy_Flashc_Get_ECC_Error
****************************************************************************//**
*
* \brief This function when ECC injection is enabled and error is injected will return no of errors generated.
*
* \returns no of errors generated with ECC error injection \ref cy_en_flash_ecc_inject_errors_t.
*
*******************************************************************************/
cy_en_flash_ecc_inject_errors_t Cy_Flashc_Get_ECC_Error(void)
{
    if (0UL != _FLD2VAL(FLASHC_ECC_INJ_EN_ECC_ERROR, FLASHC_FLASH_ECC_INJ_EN))
    {
        return CY_FLASH_ECC_ERRORS_MORE_THAN_ONE;
    }
    return CY_FLASH_ECC_ERRORS_LESS_THAN_TWO;
}


/*******************************************************************************
* Function Name: Cy_Flashc_Dual_Bank_Mode_Enable
****************************************************************************//**
*
* \brief Enables Dual bank Mode for flash
*
* \param mapping : Mapping for the main and work regions.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_Dual_Bank_Mode_Enable(cy_en_flash_dual_bank_mapping_t mapping)
{
    FLASHC_FLASH_CTL |= (_VAL2FLD(FLASHC_FLASH_CTL_BANK_MODE, 1U) |
                         _VAL2FLD(FLASHC_FLASH_CTL_BANK_MAPPING, mapping ));;
}

/*******************************************************************************
* Function Name: Cy_Flashc_Dual_Bank_Mode_Disable
****************************************************************************//**
*
* \brief Disables Dual bank Mode for flash
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_Dual_Bank_Mode_Disable(void)
{
    FLASHC_FLASH_CTL &= (uint32_t) ~(FLASHC_FLASH_CTL_BANK_MODE_Msk |
                                     FLASHC_FLASH_CTL_BANK_MAPPING_Msk);
}


#endif /*defined (CY_IP_MXS40FLASHC)*/

#if (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION >=2))
/*******************************************************************************
* Function Name: Cy_Flashc_SetWorkBankMode
****************************************************************************//**
*
* Sets bank mode for work flash
*
* mode bank mode to be set
*
*******************************************************************************/
void Cy_Flashc_SetWorkBankMode(cy_en_bankmode_t mode)
{
    if(CY_FLASH_DUAL_BANK_MODE == mode)
    {
        FLASHC_FLASH_CTL |= FLASHC_V2_FLASH_CTL_WORK_BANK_MODE_Msk;
    }
    else
    {
        FLASHC_FLASH_CTL &= (uint32_t) ~FLASHC_V2_FLASH_CTL_WORK_BANK_MODE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_GetWorkBankMode
****************************************************************************//**
*
* Gets current bank mode for work flash
*
*******************************************************************************/
cy_en_bankmode_t Cy_Flashc_GetWorkBankMode(void)
{
   uint32_t bank_mode = _FLD2VAL(FLASHC_V2_FLASH_CTL_WORK_BANK_MODE, FLASHC_FLASH_CTL);
   if(bank_mode == 0UL)
    {
        return CY_FLASH_SINGLE_BANK_MODE;
    }
    else
    {
        return CY_FLASH_DUAL_BANK_MODE;
    }
}
/*******************************************************************************
* Function Name: Cy_Flashc_SetMainBankMode
****************************************************************************//**
*
*  Sets bank mode for main flash
*
*  mode bank mode to be set
*
*******************************************************************************/
void Cy_Flashc_SetMainBankMode(cy_en_bankmode_t mode)
{
   if(CY_FLASH_DUAL_BANK_MODE == mode)
    {
        FLASHC_FLASH_CTL |= FLASHC_V2_FLASH_CTL_MAIN_BANK_MODE_Msk;
    }
    else
    {
        FLASHC_FLASH_CTL &= (uint32_t) ~FLASHC_V2_FLASH_CTL_MAIN_BANK_MODE_Msk;
    }
}

